<a href="https://colab.research.google.com/github/wesleybeckner/technology_fundamentals/blob/main/C1%20Fundamentals/SOLUTIONS/SOLUTION_Tech_Fun_C1_S3_Functions_and_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Technology Fundamentals Course 1, Session 3: Functions and Pandas Introduction

**Instructor**: Wesley Beckner<br>

**Contact**: wesleybeckner@gmail.com


**Teaching Assitants** Varsha Bang, Harsha Vardhan

**Contact** vbang@uw.edu, harshav@uw.edu


<br>

---

<br>

Today, we will discuss **_functions_** in more depth.  We've seen them previously and used them, for example the `.append()` **_function_** for lists, or the even more general `print()` function.  Here, we'll dig into how you can make your own functions to encapsulate code that you will reuse over and over.  

Then we'll jump into the **Pandas** package.  Packages are collections of related functions.  These are the things we `import`. Pandas is a two dimensional data structure like a spreadsheet in Excel. In fact, we will be importing our first dataset and viewing it, with Pandas!

<br>

---

## 3.0 Review from Session on Data Structures and Flow Control

In our last session, we discussed **_lists_**, **_dictionaries_**, and **_flow control_**.

**_Lists_** are **_ordered collections_** of data that can be used to hold multiple pieces of information while preserving their order.  We use `[` and `]` to access elements by their indices which start with `0`.  All things that operate on **_lists_** like slices use the concept of an inclusive lower bound and an exclusive upper bound.  So, the following gets elements from the **_list_** `my_list` with index values of `0`, `1`, and `2`, but **not** `3`!

```
my_list[0:3]
```

> What other way is there of writing the same statement using **_slicing_**?  Hint, think about leaving out one of the numbers in the slice!

**_Dictionaries_** are **_named_** **_collections_** of data that can be used to hold multiple pieces of information as **_values_** that are addressed by **_keys_** resulting in a **_key_** to **_value_** data structure.  They are accessed with `[` and `]` but intialized with `{` and `}`.  E.g.

```
my_dict = { 'cake' : 'Tasty!', 'toenails' : 'Gross!' }
my_dict['cake']
```

Finally, we talked about **_flow control_** and using the concept of **_conditional execution_** to decide which code statements were executed.  Remember this figure?

<img src="https://docs.oracle.com/cd/B19306_01/appdev.102/b14261/lnpls008.gif">Flow control figure</img>

> What are the **_if_** statments? <br> 
Where do **_for_** loops fit in? <br>

## 3.1 Functions

For loops let you repeat some code for every item in a list.  Functions are similar in that they run the same lines of code and, frequently, for new values of some variable (we call these **_parameters_**).  They are different in that functions are not limited to looping over items.

Functions are a critical part of writing easy to read, reusable code.

Create a function like:
```
def function_name (parameters):
    """
    optional docstring
    """
    function expressions
    return [variable]
```

Here is a simple example.  It prints a string that was passed in and returns nothing.

```
def print_string(string):
    """This prints out a string passed as the parameter."""
    print(string)
    return
```

In [ ]:
def print_string(string):
  """This prints out a string passed as the parameter"""
  print(string)
  return

To call the function, use:
```
print_string("GIX is awesome!")
```

_Note:_ The function has to be defined before you can call it!

In [ ]:
print_string("GIX is awesome!")

GIX is awesome!

### 3.1.1 Reserved words: def, return, and yield

Notice the highlighted words in our function definition: `def` and `return` these are *reserved words* in python used to define functions. Every function definition requires these reserved words. `yield` is another reserved word that is similar to `return` but operates slightly differently. It is beyond the scope of what we are covering in this session. This tutorial from [realpython](https://realpython.com/introduction-to-python-generators/) has good information on the topic.

In [ ]:
# what is return doing in this function?
def my_square(a):
  return a ** 2

`return` is going to output whatever value(s) follow after the keyword `return` when we call upon our function

In [ ]:
a = 2
my_square(a)

4

I'm going to return two values...

In [ ]:
def my_square(a):
  return a ** 2, a

and we see how the output updates accordingly

In [ ]:
my_square(a)

(4, 2)

We can capture these values on the output with...

In [ ]:
a = 3
square, new_a = my_square(a)

In [ ]:
print(square, new_a)

9 3

### 3.1.2 Global vs local variables and function parameters

In a function, new variables that you create are not saved when the function returns - these are **_local_** variables.  Variables defined outside of the function can be accessed but not changed - these are **_global_** variables.

let's define the following function

In [ ]:
def my_little_func(a):
  b = 10
  return a * b

In [ ]:
my_little_func(2)

20

if I run the following...

In [ ]:
# b

Let's play with this a little further...

...now let's define b outside the function and call our function with `a=5`

In [ ]:
# what happens here?
b = 100
my_little_func(2)

20

In [ ]:
b

100

we see that b is still 100, instead of 10 as its defined within the function. This is because b inside of `my_little_func` is a *local* variable.

it doesn't matter how I define b outside the function because within the function it is set locally.

... Let's do this A LITTLE MORE

In [ ]:
def my_new_func(a):
  print(b)
  return a*b

now if I call on my new function, because `b` is not defined locally within the function, it takes on the global value. 

This is typically not happy happy fun fun behavior for us, we want to be explicit about how we define and use our variables (but there are some times when this is appropriate to do)

In [ ]:
b = 100
a = 2 # side note, what did I do here????
my_new_func(a)

100

200

#### 3.1.1.1 Function Parameters

Parameters (or arguments) in Python are all passed by reference.  This means that if you modify the parameters in the function, they are modified outside of the function. (Enrichment: Exceptions, see below)

See the following example:

```
def change_list(my_list):
   """This changes a passed list into this function"""
   my_list.append('four');
   print('list inside the function: ', my_list)
   return

my_list = [1, 2, 3];
print('list before the function: ', my_list)
change_list(my_list);
print('list after the function: ', my_list)
```

In [ ]:
def change_list(my_list):
   """This changes a passed list into this function"""
   my_list.append('four');
   print('list inside the function: ', my_list)
   return

my_list = [1, 2, 3]
print('list before the function: ', my_list)
change_list(my_list)
print('list after the function: ', my_list)

list before the function:  [1, 2, 3]
list inside the function:  [1, 2, 3, 'four']
list after the function:  [1, 2, 3, 'four']

#### 3.1.1.2 Enrichment: Global, local, and immutables

Let's go back to our former example...

immutables:

* integers, float, str, tuples

In [ ]:
# b = "a string"
# b = 10
# b = 10.2
# b = (10, 2)
b = [10, 2]

def my_little_func(b):
  if type(b) == str:
    b += "20"
  elif (type(b) == int) or (type(b) == float):
    b += 10
  elif (type(b) == tuple):
    print("AYYY no tuple changes, Dude")
    pass
  elif (type(b) == list):
    b.append('whoaaaa')
  print(b)
  return

print(b)
my_little_func(b)
print(b)

[10, 2]
[10, 2, 'whoaaaa']
[10, 2, 'whoaaaa']

There is a way to change a global variable within a function with the **_global_** keyword.  Generally, the use of **_global_** variables is not encouraged, instead use parameters. We won't cover the global keyword here but you can [explore further](https://www.programiz.com/python-programming/global-keyword) on your own if you are interested.

In [ ]:
b = 10
a = 2

def my_little_func(a):
  global b
  b += 20
  print(b)
  return 

print(b)
my_little_func(a)
print(b)

10
30
30

#### Exercise 1: My first function

Write a function that takes one parameter and returns any data structure

> If you are going to return multiple objects, what data structure that we talked about can be used?  Give and example below.

In [ ]:
# Cell for excerise 1
def test(a):
  return a * 10

In [ ]:
def my_first_function(a):
    return type(a)

m='haha'
my_first_function(m)

str

### 3.1.3 Parameter types

**Function calling:**

* positional 
    * `func(10, 20)`
* keyword
    * `func(a=10, b=20)` or `func(b=20, a=10)`

**Function writing:**
* no default
    * `def func(a, b)`
* default
    * `def func(a=10, b=20)`

```
def print_name(first, last='Beckner'):
    print(f'Your name is {first} {last}')
    return
```

In [ ]:
def print_name(first, last='Beckner'):
    print("Your name is {} {}".format(first, last))
    return

In [ ]:
print_name('Wesley')

Your name is Wesley Beckner

Play around with the above function.

In [ ]:
print_name('Wesley', last='Solo')

Your name is Wesley Solo

Functions can contain any code that you put anywhere else including:
* `if`...`elif`...`else`
* `for`...`while`
* other function calls

```
def print_name_age(first, last, age):
    print_name(first, last)
    print('Your age is %d' % (age))
    if age > 25 and age < 40:
        print('You are a millenial!')
    return
```

In [ ]:
def print_name_age(first, last, age):
    print_name(first, last)
    print('Your age is %d' % (age))
    if age > 25 and age < 40:
        print('You are a millenial!')
    return

```
print_name_age(age=29, last='Beckner', first='Wesley')
```

In [ ]:
print_name_age(age=29, last='Beckner', first='Wesley')

Your name is Wesley Beckner
Your age is 29
You are a millenial!

### 3.1.4 Docstrings

Quick example on docstrings from [sklearn knn](https://scikit-learn.org/stable/modules/generated/sklearn.neighbors.KNeighborsClassifier.html)

## 3.2 The scientific python stack

In addition to Python's built-in modules like the ``math`` module we explored above, there are also many often-used third-party modules that are core tools for doing data science with Python.
Some of the most important ones are:

#### [``numpy``](http://numpy.org/): Numerical Python

Numpy is short for "Numerical Python", and contains tools for efficient manipulation of arrays of data.
If you have used other computational tools like IDL or MatLab, Numpy should feel very familiar.

#### [``scipy``](http://scipy.org/): Scientific Python

Scipy is short for "Scientific Python", and contains a wide range of functionality for accomplishing common scientific tasks, such as optimization/minimization, numerical integration, interpolation, and much more.
We will not look closely at Scipy today, but we will use its functionality later in the course.

#### [``pandas``](http://pandas.pydata.org/): Labeled Data Manipulation in Python

Pandas is short for "Panel Data", and contains tools for doing more advanced manipulation of labeled data in Python, in particular with a columnar data structure called a *Data Frame*.
If you've used the [R](http://rstats.org) statistical language (and in particular the so-called "Hadley Stack"), much of the functionality in Pandas should feel very familiar.

#### [``matplotlib``](http://matplotlib.org): Visualization in Python

Matplotlib started out as a Matlab plotting clone in Python, and has grown from there in the 15 years since its creation. It is the most popular data visualization tool currently in the Python data world (though other recent packages are starting to encroach on its monopoly).

#### [``scikit-learn``](https://scikit-learn.org/stable/): Machine Learning in Python

Scikit-learn is a machine learning library.

It features various classification, regression, and clustering algorithms, including support vector machines, random forests, gradient boosting, k-means, and DBSCAN.

The library is designed to interoperate with the Python numerical and scientific libraries NumPy and SciPy.

## 3.3 Pandas

### 3.3.1 Pandas and Scikit-Learn `load_datasets`

We begin by loading the Panda's package.  Packages are collections of functions that share a common utility.  We've seen `import` before.  Let's use it to import Pandas and all the richness that pandas has.

We'll also use a very useful feature of the scikit-learn toolkit, the `load_datasets` module. We will do some very rudimentary tasks with this dataset, just to demonstrate the utility of `load_datasets`, then we will switch over to a more relevant dataset for our purposes.

```
import pandas
from sklearn.datasets import load_wine
```

In [ ]:
import pandas
from sklearn.datasets import load_wine

We import a function `load_wine` that loads a simple data set we can play with called the Wine recognition dataset from the 1980s.

You can read more about that dataset [here](https://archive.ics.uci.edu/ml/datasets/Wine)

```
dataset = load_wine()
print(dataset.DESCR)
```

In [ ]:
dataset = load_wine()
print(dataset.DESCR)

.. _wine_dataset:

Wine recognition dataset
------------------------

**Data Set Characteristics:**

    :Number of Instances: 178 (50 in each of three classes)
    :Number of Attributes: 13 numeric, predictive attributes and the class
    :Attribute Information:
 		- Alcohol
 		- Malic acid
 		- Ash
		- Alcalinity of ash
 		- Magnesium
		- Total phenols
 		- Flavanoids
 		- Nonflavanoid phenols
 		- Proanthocyanins
		- Color intensity
 		- Hue
 		- OD280/OD315 of diluted wines
 		- Proline

    - class:
            - class_0
            - class_1
            - class_2

    :Summary Statistics:

    ============================= ==== ===== ======= =====
                                   Min   Max   Mean     SD
    ============================= ==== ===== ======= =====
    Alcohol:                      11.0  14.8    13.0   0.8
    Malic Acid:                   0.74  5.80    2.34  1.12
    Ash:                          1.36  3.23    2.36  0.27
    Alcalinity of Ash:            10.6  30.0    19.5   3.3
    Magnesium:                    70.0 162.0    99.7  14.3
    Total Phenols:                0.98  3.88    2.29  0.63
    Flavanoids:                   0.34  5.08    2.03  1.00
    Nonflavanoid Phenols:         0.13  0.66    0.36  0.12
    Proanthocyanins:              0.41  3.58    1.59  0.57
    Colour Intensity:              1.3  13.0     5.1   2.3
    Hue:                          0.48  1.71    0.96  0.23
    OD280/OD315 of diluted wines: 1.27  4.00    2.61  0.71
    Proline:                       278  1680     746   315
    ============================= ==== ===== ======= =====

    :Missing Attribute Values: None
    :Class Distribution: class_0 (59), class_1 (71), class_2 (48)
    :Creator: R.A. Fisher
    :Donor: Michael Marshall (MARSHALL%PLU@io.arc.nasa.gov)
    :Date: July, 1988

This is a copy of UCI ML Wine recognition datasets.
https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data

The data is the results of a chemical analysis of wines grown in the same
region in Italy by three different cultivators. There are thirteen different
measurements taken for different constituents found in the three types of
wine.

Original Owners:

Forina, M. et al, PARVUS -
An Extendible Package for Data Exploration, Classification and Correlation.
Institute of Pharmaceutical and Food Analysis and Technologies,
Via Brigata Salerno, 16147 Genoa, Italy.

Citation:

Lichman, M. (2013). UCI Machine Learning Repository
[https://archive.ics.uci.edu/ml]. Irvine, CA: University of California,
School of Information and Computer Science.

.. topic:: References

  (1) S. Aeberhard, D. Coomans and O. de Vel,
  Comparison of Classifiers in High Dimensional Settings,
  Tech. Rep. no. 92-02, (1992), Dept. of Computer Science and Dept. of
  Mathematics and Statistics, James Cook University of North Queensland.
  (Also submitted to Technometrics).

  The data was used with many others for comparing various
  classifiers. The classes are separable, though only RDA
  has achieved 100% correct classification.
  (RDA : 100%, QDA 99.4%, LDA 98.9%, 1NN 96.1% (z-transformed data))
  (All results using the leave-one-out technique)

  (2) S. Aeberhard, D. Coomans and O. de Vel,
  "THE CLASSIFICATION PERFORMANCE OF RDA"
  Tech. Rep. no. 92-01, (1992), Dept. of Computer Science and Dept. of
  Mathematics and Statistics, James Cook University of North Queensland.
  (Also submitted to Journal of Chemometrics).

```
df = pandas.DataFrame()
```

In [ ]:
df = pandas.DataFrame()

#### 3.3.1.1 import ... as ... pattern

Because we'll use it so much, we often import under a shortened name using the ``import ... as ...`` pattern:

```
import pandas as pd
```

In [ ]:
import pandas as pd

### 3.3.2 Creating pandas dataframes

Let's create an empty _data frame_ and put the result into a variable called `df`.  This is a popular choice for a _data frame_ variable name.

```
df = pd.DataFrame()
```

In [ ]:
df = pd.DataFrame()

Let's open the Wine dataset as a pandas data frame.  Notice we change the value of the `df` variable to point to a new data frame.

```
df = pd.DataFrame(dataset.data, columns=dataset.feature_names)
```

In [ ]:
df = pd.DataFrame(dataset.data, columns=dataset.feature_names)

#### 3.3.2.1 From excel and csv

Please follow this [link](https://raw.githubusercontent.com/wesleybeckner/ds_for_engineers/main/data/truffle_margin/margin_data.csv)

This is what we call a csv or comma separated value file. We have a method reading these directly into pandas:

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/wesleybeckner/technology_explorers/main/assets/imdb_movies.csv')

/usr/local/lib/python3.7/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (3) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

We can do this in a similar way with excel files.

In [ ]:
pd.read_excel('https://raw.githubusercontent.com/wesleybeckner/ds_for_engineers/main/data/truffle_margin/margin_data.xlsx')

     Base Cake  ...                                            Product
0     Tiramisu  ...  Tiramisu-Chocolate Outer-Doughnut-Egg Nog-Amet...
1     Tiramisu  ...  Tiramisu-Chocolate Outer-Doughnut-Egg Nog-Amet...
2     Tiramisu  ...  Tiramisu-Chocolate Outer-Chocolate-Pear-Amethy...
3     Tiramisu  ...  Tiramisu-Chocolate Outer-Doughnut-Egg Nog-Amet...
4     Tiramisu  ...  Tiramisu-Chocolate Outer-Doughnut-Rock and Rye...
...        ...  ...                                                ...
2501    Butter  ...  Butter-Chocolate Outer-Lemon Bar-Wild Cherry C...
2502    Butter  ...  Butter-Chocolate Outer-Cream Soda-Peppermint-A...
2503    Butter  ...  Butter-Jelly Filled-Orange-Cucumber-Burgundy-9...
2504    Butter  ...  Butter-Chocolate Outer-Horchata-Dill Pickle-Am...
2505    Butter  ...  Butter-Candy Outer-Ginger Lime-Vanilla-Amethys...

[2506 rows x 10 columns]

#### 3.3.2.2 from lists

In [ ]:
my_list = [[1, 2, 3], [3, 4, 5], [5, 6, 7], [7, 8, 9]]
pd.DataFrame(my_list)

   0  1  2
0  1  2  3
1  3  4  5
2  5  6  7
3  7  8  9

In [ ]:
df_nums = pd.DataFrame(data=[[1, 2, 3], [3, 4, 5], [5, 6, 7], [7, 8, 9]], 
             columns=['x', 'y', 'z'])
df_nums.index = ['a', 'b', 'c', 'd']
df_nums

   x  y  z
a  1  2  3
b  3  4  5
c  5  6  7
d  7  8  9

#### 3.3.2.3 from dictionaries

In [ ]:
my_dictionary = {'A': ['apple', 'airplane'], 'B': ['bannana', 'bubbles']}
from_dict = pd.DataFrame(my_dictionary)
from_dict

          A        B
0     apple  bannana
1  airplane  bubbles

In [ ]:
from_dict.to_dict()

{'A': {0: 'apple', 1: 'airplane'}, 'B': {0: 'bannana', 1: 'bubbles'}}

#### Exercise 2: Create a DataFrame

Create a dictionary with the following keys: `movies, songs, books`. In each key list your top 5 favorites in the cooresponding category. Then use `pd.DataFrame` to turn this into a dictionary.

In [ ]:
# Cell for Ex 2
faves = {'movies': ['The Matrix', 'The Return of the King', 'Howls Moving Castle',
                    'Harold and Maude', 'The Truman Show'],
         'songs': ['Clair de Lune', 'Father Ocean', 'Sun & Moon', 
                   'Infinite Resource', 'Father and Son'],
         'books': ['Buddhas Brain', 'The Tombs of Antuan', 'The Gunslinger',
                   'Wizard and Glass', 'Dune']}
faves = pd.DataFrame(faves)
faves

                   movies              songs                books
0              The Matrix      Clair de Lune        Buddhas Brain
1  The Return of the King       Father Ocean  The Tombs of Antuan
2     Howls Moving Castle         Sun & Moon       The Gunslinger
3        Harold and Maude  Infinite Resource     Wizard and Glass
4         The Truman Show     Father and Son                 Dune

#### 3.3.2.4 on `pandas.Series`

pandas `Series` objects will percolate in our experience here and there, however they are not so important as for us to wish to spend dedicated time on them. For now, know that they are a lower-level data collection in the pandas framework. You can think of them as an individual column or row in the pandas dataframe. For more practice with these you can refer to [this documentation]()

In [ ]:
df['movies']

0                The Matrix
1    The Return of the King
2       Howls Moving Castle
3          Harold and Maude
4           The Truman Show
Name: movies, dtype: object

### 3.3.3 Viewing pandas dataframes

The ``head()`` and ``tail()`` methods show us the first and last rows of the data.

```
df.head()
df.tail()
```

In [ ]:
df.head(5)

  imdb_title_id  ... reviews_from_critics
0     tt0000009  ...                  2.0
1     tt0000574  ...                  7.0
2     tt0001892  ...                  2.0
3     tt0002101  ...                  3.0
4     tt0002130  ...                 14.0

[5 rows x 22 columns]

In [ ]:
df.tail(7)

      imdb_title_id  ... reviews_from_critics
85848     tt9905462  ...                  NaN
85849     tt9906644  ...                  1.0
85850     tt9908390  ...                  4.0
85851     tt9911196  ...                  4.0
85852     tt9911774  ...                  NaN
85853     tt9914286  ...                  NaN
85854     tt9914942  ...                  2.0

[7 rows x 22 columns]

The ``shape`` attribute shows us the number of elements:

```
df.shape
```

Note it doesn't have the `()` because it isn't a **_function_** - it is an **_attribute_** or variable attached to the `df` object.

In [ ]:
df.shape

(85855, 22)

The ``columns`` attribute gives us the column names

```
df.columns
```

In [ ]:
df.columns

Index(['imdb_title_id', 'title', 'original_title', 'year', 'date_published',
       'genre', 'duration', 'country', 'language', 'director', 'writer',
       'production_company', 'actors', 'description', 'avg_vote', 'votes',
       'budget', 'usa_gross_income', 'worlwide_gross_income', 'metascore',
       'reviews_from_users', 'reviews_from_critics'],
      dtype='object')

The ``index`` attribute gives us the index names

```
df.index
```

In [ ]:
df.index

RangeIndex(start=0, stop=85855, step=1)

The ``dtypes`` attribute gives the data types of each column, remember the data type *_floating point_**?:

```
df.dtypes
```

In [ ]:
df.dtypes

imdb_title_id             object
title                     object
original_title            object
year                      object
date_published            object
genre                     object
duration                   int64
country                   object
language                  object
director                  object
writer                    object
production_company        object
actors                    object
description               object
avg_vote                 float64
votes                      int64
budget                    object
usa_gross_income          object
worlwide_gross_income     object
metascore                float64
reviews_from_users       float64
reviews_from_critics     float64
dtype: object

In [ ]:
df.describe()

           duration      avg_vote  ...  reviews_from_users  reviews_from_critics
count  85855.000000  85855.000000  ...        78258.000000          74058.000000
mean     100.351418      5.898656  ...           46.040826             27.479989
std       22.553848      1.234987  ...          178.511411             58.339158
min       41.000000      1.000000  ...            1.000000              1.000000
25%       88.000000      5.200000  ...            4.000000              3.000000
50%       96.000000      6.100000  ...            9.000000              8.000000
75%      108.000000      6.800000  ...           27.000000             23.000000
max      808.000000      9.900000  ...        10472.000000            999.000000

[8 rows x 6 columns]

#### Exercise 3: Viewing DataFrames

Using the dataframe you made in exercise 2, return the following attributes: the datatype stored in each column, the column names, the indices, and the shape.

In [ ]:
# Cell for Ex 3
print(faves.dtypes)
print(faves.columns)
print(faves.index)
print(faves.shape)

movies    object
songs     object
books     object
dtype: object
Index(['movies', 'songs', 'books'], dtype='object')
RangeIndex(start=0, stop=5, step=1)
(5, 3)

In [ ]:
my_dictionary = {'A': ['apple', 'airplane'], 'B': ['bananana', 'bubbles']}
my_dictionary

{'A': ['apple', 'airplane'], 'B': ['bananana', 'bubbles']}

In [ ]:
my_dictionary.pop('A')

['apple', 'airplane']

In [ ]:
my_dictionary

{'B': ['bananana', 'bubbles']}

### 3.3.4 Manipulating data with ``pandas``

Here we'll cover some key features of manipulating data with pandas

#### 3.3.4.1 Selection

Access columns by name using square-bracket indexing:

```
df['duration']
```

In [ ]:
df['duration']

0         45
1         70
2         53
3        100
4         68
        ...
85850     95
85851    103
85852    130
85853     98
85854     74
Name: duration, Length: 85855, dtype: int64

Mathematical operations on columns happen *element-wise*:

```
df['duration'] / 60
```

In [ ]:
df['duration'] / 60

0        0.750000
1        1.166667
2        0.883333
3        1.666667
4        1.133333
           ...
85850    1.583333
85851    1.716667
85852    2.166667
85853    1.633333
85854    1.233333
Name: duration, Length: 85855, dtype: float64


Columns can be created (or overwritten) with the assignment operator.
Let's create a column with duration in hours.

```
df['duration (hours)'] = df['duration'] / 60
```

In [ ]:
df['duration (hours)'] = df['duration'] / 60

Let's use the `.head()` **_function_** to see our new data!

```
df.head()
```

In [ ]:
df.head()

  imdb_title_id  ... duration (hours)
0     tt0000009  ...         0.750000
1     tt0000574  ...         1.166667
2     tt0001892  ...         0.883333
3     tt0002101  ...         1.666667
4     tt0002130  ...         1.133333

[5 rows x 23 columns]

##### 3.3.4.1.1 `loc` and `iloc`

Pandas provides a powerful way to work with both rows and columns together, optionally using their label indices or numeric indices.

- **`.loc :`**<br/>
Purely label-location based indexer for selection by label (but may also be used with a boolean array).<br/>
  **Important: If you use slicing in loc, it will return the end index as well**
  

- **`.iloc:`**<br/>
Purely integer-location based indexing for selection by position (but may also be used with a boolean array).

In [ ]:
df.columns

Index(['imdb_title_id', 'title', 'original_title', 'year', 'date_published',
       'genre', 'duration', 'country', 'language', 'director', 'writer',
       'production_company', 'actors', 'description', 'avg_vote', 'votes',
       'budget', 'usa_gross_income', 'worlwide_gross_income', 'metascore',
       'reviews_from_users', 'reviews_from_critics', 'duration (hours)'],
      dtype='object')

In [ ]:
df.loc[::2, ::2]

      imdb_title_id  ... duration (hours)
0         tt0000009  ...         0.750000
2         tt0001892  ...         0.883333
4         tt0002130  ...         1.133333
6         tt0002423  ...         1.416667
8         tt0002452  ...         2.000000
...             ...  ...              ...
85846     tt9904802  ...         1.533333
85848     tt9905462  ...         1.850000
85850     tt9908390  ...         1.583333
85852     tt9911774  ...         2.166667
85854     tt9914942  ...         1.233333

[42928 rows x 12 columns]

In [ ]:
df.iloc[-5:, -5:]

      worlwide_gross_income  metascore  ...  reviews_from_critics  duration (hours)
85850             $ 3507171        NaN  ...                   4.0          1.583333
85851             $ 7299062        NaN  ...                   4.0          1.716667
85852                   NaN        NaN  ...                   NaN          2.166667
85853                $ 2833        NaN  ...                   NaN          1.633333
85854               $ 59794        NaN  ...                   2.0          1.233333

[5 rows x 5 columns]

##### 3.3.4.1.2 column vs index access

In [ ]:
df['title'][:10]

0                                           Miss Jerry
1                          The Story of the Kelly Gang
2                                       Den sorte drÃ¸m
3                                            Cleopatra
4                                            L'Inferno
5    From the Manger to the Cross; or, Jesus of Naz...
6                                       Madame DuBarry
7                                           Quo Vadis?
8                                Independenta Romaniei
9                                          Richard III
Name: title, dtype: object

In [ ]:
df[:10]['title']

0                                           Miss Jerry
1                          The Story of the Kelly Gang
2                                       Den sorte drÃ¸m
3                                            Cleopatra
4                                            L'Inferno
5    From the Manger to the Cross; or, Jesus of Naz...
6                                       Madame DuBarry
7                                           Quo Vadis?
8                                Independenta Romaniei
9                                          Richard III
Name: title, dtype: object

In [ ]:
# df[0] # will return an error

In [ ]:
my_list = [[10, 20, 30]]*4
my_list

[[10, 20, 30], [10, 20, 30], [10, 20, 30], [10, 20, 30]]

In [ ]:
my_list = [[10, 20, 30]]*4
mydf = pd.DataFrame(my_list, 
                    index=['a','b','c','d'], 
                    columns=['alpha', 'beta', 'gamma'])
mydf

   alpha  beta  gamma
a     10    20     30
b     10    20     30
c     10    20     30
d     10    20     30

In [ ]:
mydf.loc['a', 'alpha'] = 'mychange'
mydf.loc[['a', 'b'],['alpha']]

      alpha
a  mychange
b        10

In [ ]:
# using this you will get a setting
# with copy warning (depending on your pandas warning settings)
mydf['alpha']['a'] = 'newchange'

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

You want to use `loc` or `iloc` when setting new values to pandas dataframes.

##### Exercise 4: Selecting

select the first 10 rows of the country, genre, and year columns using `loc`. Repeat the same exercise using `iloc`

In [ ]:
# Cell for Ex 4
df.loc[:10, ['country', 'genre', 'year']]

             country                      genre  year
0                USA                    Romance  1894
1          Australia    Biography, Crime, Drama  1906
2   Germany, Denmark                      Drama  1911
3                USA             Drama, History  1912
4              Italy  Adventure, Drama, Fantasy  1911
5                USA           Biography, Drama  1912
6            Germany  Biography, Drama, Romance  1919
7              Italy             Drama, History  1913
8            Romania               History, War  1912
9        France, USA                      Drama  1912
10           Denmark                      Drama  1913

In [ ]:
df.columns

Index(['imdb_title_id', 'title', 'original_title', 'year', 'date_published',
       'genre', 'duration', 'country', 'language', 'director', 'writer',
       'production_company', 'actors', 'description', 'avg_vote', 'votes',
       'budget', 'usa_gross_income', 'worlwide_gross_income', 'metascore',
       'reviews_from_users', 'reviews_from_critics', 'duration (hours)'],
      dtype='object')

In [ ]:
df.iloc[:10, [3,7,5]]

   year           country                      genre
0  1894               USA                    Romance
1  1906         Australia    Biography, Crime, Drama
2  1911  Germany, Denmark                      Drama
3  1912               USA             Drama, History
4  1911             Italy  Adventure, Drama, Fantasy
5  1912               USA           Biography, Drama
6  1919           Germany  Biography, Drama, Romance
7  1913             Italy             Drama, History
8  1912           Romania               History, War
9  1912       France, USA                      Drama

#### 3.3.4.2 Filtering

filtering down your selection will be BIGLY useful in your data quests

##### 3.3.4.2.1 By String

one of the first tools we'll use to filter our dataset is the `.str.contains` method. Let's take an example.

In [ ]:
# remember, if we don't remember our column mames we can quickly pull them up 
# with:
df.columns

Index(['imdb_title_id', 'title', 'original_title', 'year', 'date_published',
       'genre', 'duration', 'country', 'language', 'director', 'writer',
       'production_company', 'actors', 'description', 'avg_vote', 'votes',
       'budget', 'usa_gross_income', 'worlwide_gross_income', 'metascore',
       'reviews_from_users', 'reviews_from_critics', 'duration (hours)'],
      dtype='object')

In [ ]:
df['description']

0        The adventures of a female reporter in the 1890s.
1        True story of notorious Australian outlaw Ned ...
2        Two men of high rank are both wooing the beaut...
3        The fabled queen of Egypt's affair with Roman ...
4        Loosely adapted from Dante's Divine Comedy and...
                               ...
85850    A psychiatric hospital patient pretends to be ...
85851    A middle-aged veterinary surgeon believes his ...
85852                                                  NaN
85853                                                  NaN
85854    Pep, a 13-year-old boy, is in love with a girl...
Name: description, Length: 85855, dtype: object

In [ ]:
df.loc[df['description'].str.contains('artificial intelligence', na=False)].shape

(12, 23)

or if you know the exact string you are looking for

In [ ]:
df.loc[df['title'] == "Fight Club"]

      imdb_title_id       title  ... reviews_from_critics duration (hours)
32487     tt0137523  Fight Club  ...                370.0         2.316667

[1 rows x 23 columns]

##### 3.3.4.2.2 By numerical value

In [ ]:
df[df['votes'] > 1000]

      imdb_title_id  ... duration (hours)
4         tt0002130  ...         1.133333
11        tt0002844  ...         0.900000
13        tt0003037  ...         1.016667
16        tt0003165  ...         1.500000
18        tt0003419  ...         1.416667
...             ...  ...              ...
85811     tt9860728  ...         1.633333
85817     tt9866700  ...         1.533333
85837     tt9894470  ...         1.533333
85839     tt9898858  ...         1.466667
85843     tt9900782  ...         2.416667

[29362 rows x 23 columns]

##### Exercise 5: Filtering

* Filter `df` for all the movies that are longer than 2 hours
* Filter `df` for all movies where 'day' is in the title

In [ ]:
# Cell for Ex 5
df.loc[df['duration'] > 120].shape

(11166, 23)

In [ ]:
df.loc[df['title'].str.contains('day')].shape

(202, 23)

#### 3.3.4.3 Select, filter, operation

The real power of Pandas comes in its tools for grouping and aggregating data. Here we'll look at *value counts* and the basics of *group-by* operations.

In [ ]:
# a basic select, filter, operate procedure would look like:
df[df['country'] == 'USA']['duration'].describe()

count    28511.000000
mean        93.050437
std         18.576873
min         42.000000
25%         84.000000
50%         91.000000
75%        100.000000
max        398.000000
Name: duration, dtype: float64

we can invert the selection with `~`

In [ ]:
df[~(df['country'] == 'USA')]['duration'].describe()

count    57344.000000
mean       103.981410
std         23.459158
min         41.000000
25%         90.000000
50%         99.000000
75%        112.000000
max        808.000000
Name: duration, dtype: float64

In preparation for grouping the data, let's bin the instances by their duration (we could have chosen any numerical column). For that, we'll use ``pd.cut``.  The documentation for ``pd.cut`` can be found [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.cut.html). It is used to bin values into discrete intervals.  This is like a histogram where for each *bin* along the range of data values, you count the number of occurrences of that bin.  in our example, we'll use 10 bins and let Pandas decide how to evenly divide the range into the bins.  Let's see it in action.

```
df['duration_group'] = pd.cut(df['duration'], 10)
df.head()
df.dtypes
```

In [ ]:
df['duration'].describe()

count    85855.000000
mean       100.351418
std         22.553848
min         41.000000
25%         88.000000
50%         96.000000
75%        108.000000
max        808.000000
Name: duration, dtype: float64

In [ ]:
pd.cut(df['duration'], 10)

0        (40.233, 117.7]
1        (40.233, 117.7]
2        (40.233, 117.7]
3        (40.233, 117.7]
4        (40.233, 117.7]
              ...
85850    (40.233, 117.7]
85851    (40.233, 117.7]
85852     (117.7, 194.4]
85853    (40.233, 117.7]
85854    (40.233, 117.7]
Name: duration, Length: 85855, dtype: category
Categories (10, interval[float64]): [(40.233, 117.7] < (117.7, 194.4] < (194.4, 271.1] <
                                     (271.1, 347.8] ... (501.2, 577.9] < (577.9, 654.6] <
                                     (654.6, 731.3] < (731.3, 808.0]]

In [ ]:
df['duration_group'] = pd.cut(df['duration'], 10)

In [ ]:
df.head()

  imdb_title_id                        title  ... duration (hours)   duration_group
0     tt0000009                   Miss Jerry  ...         0.750000  (40.233, 117.7]
1     tt0000574  The Story of the Kelly Gang  ...         1.166667  (40.233, 117.7]
2     tt0001892               Den sorte drÃ¸m  ...         0.883333  (40.233, 117.7]
3     tt0002101                    Cleopatra  ...         1.666667  (40.233, 117.7]
4     tt0002130                    L'Inferno  ...         1.133333  (40.233, 117.7]

[5 rows x 24 columns]

In [ ]:
df.dtypes

imdb_title_id              object
title                      object
original_title             object
year                       object
date_published             object
genre                      object
duration                    int64
country                    object
language                   object
director                   object
writer                     object
production_company         object
actors                     object
description                object
avg_vote                  float64
votes                       int64
budget                     object
usa_gross_income           object
worlwide_gross_income      object
metascore                 float64
reviews_from_users        float64
reviews_from_critics      float64
duration (hours)          float64
duration_group           category
dtype: object

Pandas includes an array of useful functionality for manipulating and analyzing tabular data.
We'll take a look at two of these here.

The ``pandas.value_counts`` returns statistics on the unique values within each column.

We can use it, for example, to break down the movies by their duration group that we just created:

```
pd.value_counts(df['duration_group'], sort=False)
```

In [ ]:
pd.value_counts(df['duration_group'], sort=False)

(40.233, 117.7]    72368
(117.7, 194.4]     13197
(194.4, 271.1]       228
(271.1, 347.8]        40
(347.8, 424.5]        11
(424.5, 501.2]         4
(501.2, 577.9]         4
(577.9, 654.6]         1
(654.6, 731.3]         1
(731.3, 808.0]         1
Name: duration_group, dtype: int64

What happens if we try this on a continuous valued variable?

```
pd.value_counts(df['duration'])
```

In [ ]:
pd.value_counts(df['duration'])

90     5162
95     3194
100    3106
92     2418
93     2414
       ...
279       1
301       1
345       1
729       1
319       1
Name: duration, Length: 266, dtype: int64

##### Exercise 6: `value_counts, unique, nunique`

We can do a little data exploration with this by seeing how common different values are. Play around with these pandas methods:

* `value_counts()`
* `unique()`
* `nunique()`

Also be sure to use:

* selection
* filteration
* (and you are already using operation with the above mentioned pandas methods, value_counts, unique, nunique (: )

Do so with 3 different columns in the dataframe

In [ ]:
# Cell for Exercise 6
df[(df['country'] == 'USA') & (df['votes'] > 1000)]['director'].value_counts()

Michael Curtiz                   40
John Ford                        37
Woody Allen                      36
Clint Eastwood                   34
Raoul Walsh                      32
                                 ..
Richard Howard                    1
Curt A. Sindelar                  1
Don Chaffey                       1
Jerry Zucker                      1
Jennifer Flackett, Mark Levin     1
Name: director, Length: 5140, dtype: int64

In [ ]:
df[(df['country'] == 'USA') & (df['votes'] > 1000)]['director'].nunique()

5140

#### 3.3.4.4 Group-by Operation

One of the killer features of the Pandas dataframe is the ability to do group-by operations.
You can visualize the group-by like this (image borrowed from the [Python Data Science Handbook](http://shop.oreilly.com/product/0636920034919.do))

![image](https://swcarpentry.github.io/r-novice-gapminder/fig/12-plyr-fig1.png)

#### 3.3.4.5 Summary statistics with groupby: `value_counts`,  `count`, `describe`

Let's break take this in smaller steps.
Recall our ``duration_group`` column.

```
pd.value_counts(df['duration_group'])
```

In [ ]:
pd.value_counts(df['duration_group'])

(40.233, 117.7]    72368
(117.7, 194.4]     13197
(194.4, 271.1]       228
(271.1, 347.8]        40
(347.8, 424.5]        11
(501.2, 577.9]         4
(424.5, 501.2]         4
(731.3, 808.0]         1
(654.6, 731.3]         1
(577.9, 654.6]         1
Name: duration_group, dtype: int64

`groupby` allows us to look at the number of values for each column and each value.  The group by documentation is [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.groupby.html).  Basically, `groupby` allows us to create *groups* of records based on their values. Let's count how many records, or rows, in our data set fall into each bin of our duration data.

```
df.groupby(['duration_group']).count()
```

In [ ]:
df.groupby(['duration_group']).count()

                 imdb_title_id  title  ...  reviews_from_critics  duration (hours)
duration_group                         ...
(40.233, 117.7]          72368  72368  ...                 63321             72368
(117.7, 194.4]           13197  13197  ...                 10493             13197
(194.4, 271.1]             228    228  ...                   188               228
(271.1, 347.8]              40     40  ...                    37                40
(347.8, 424.5]              11     11  ...                    10                11
(424.5, 501.2]               4      4  ...                     4                 4
(501.2, 577.9]               4      4  ...                     3                 4
(577.9, 654.6]               1      1  ...                     0                 1
(654.6, 731.3]               1      1  ...                     1                 1
(731.3, 808.0]               1      1  ...                     1                 1

[10 rows x 23 columns]

Now, let's find the mean of each of the columns for each ``duration_group``.  *Notice* what happens to the non-numeric columns.

```
df.groupby(['duration_group']).mean()
```

In [ ]:
df.groupby(['duration_group']).mean()

                   duration  avg_vote  ...  reviews_from_critics  duration (hours)
duration_group                         ...
(40.233, 117.7]   93.147026  5.786671  ...             24.517601          1.552450
(117.7, 194.4]   136.552550  6.488513  ...             45.365958          2.275876
(194.4, 271.1]   220.394737  6.997368  ...             29.015957          3.673246
(271.1, 347.8]   302.975000  6.810000  ...             21.513514          5.049583
(347.8, 424.5]   384.636364  7.181818  ...             18.100000          6.410606
(424.5, 501.2]   454.000000  7.700000  ...             24.500000          7.566667
(501.2, 577.9]   547.500000  7.875000  ...              8.666667          9.125000
(577.9, 654.6]   580.000000  5.800000  ...                   NaN          9.666667
(654.6, 731.3]   729.000000  7.800000  ...             30.000000         12.150000
(731.3, 808.0]   808.000000  7.700000  ...             23.000000         13.466667

[10 rows x 7 columns]

You can specify a groupby using the names of table columns and compute other functions, such as the ``sum``, ``count``, ``std``, and ``describe``.

```
df.groupby(['duration_group'])['metascore'].describe()
```

In [ ]:
df.groupby(['duration_group'])['metascore'].describe()

                   count       mean        std   min    25%   50%    75%    max
duration_group
(40.233, 117.7]  10759.0  54.153267  17.655622   1.0  41.00  55.0  67.00  100.0
(117.7, 194.4]    2506.0  63.042298  16.265137   9.0  52.00  64.0  75.00  100.0
(194.4, 271.1]      28.0  76.500000  20.532720  10.0  69.75  82.0  90.00  100.0
(271.1, 347.8]       8.0  79.375000  12.070478  56.0  72.25  84.5  88.25   90.0
(347.8, 424.5]       1.0  89.000000        NaN  89.0  89.00  89.0  89.00   89.0
(424.5, 501.2]       1.0  59.000000        NaN  59.0  59.00  59.0  59.00   59.0
(501.2, 577.9]       0.0        NaN        NaN   NaN    NaN   NaN    NaN    NaN
(577.9, 654.6]       0.0        NaN        NaN   NaN    NaN   NaN    NaN    NaN
(654.6, 731.3]       1.0  87.000000        NaN  87.0  87.00  87.0  87.00   87.0
(731.3, 808.0]       1.0  77.000000        NaN  77.0  77.00  77.0  77.00   77.0

The simplest version of a groupby looks like this, and you can use almost any aggregation function you wish (mean, median, sum, minimum, maximum, standard deviation, count, etc.)

```
<data object>.groupby(<grouping values>).<aggregate>()
```

You can even group by multiple values: for example we can look at the metascore grouped by the ``duration_group`` and ``country``.

In [ ]:
df.groupby(['duration_group', 'country'])['metascore'].describe()

                                                                count  ...   max
duration_group  country                                                ...
(40.233, 117.7] Afghanistan, France                               0.0  ...   NaN
                Afghanistan, France, Germany, UK                  1.0  ...  64.0
                Afghanistan, Iran                                 0.0  ...   NaN
                Afghanistan, Ireland, Japan, Iran, Netherlands    1.0  ...  83.0
                Albania                                           0.0  ...   NaN
...                                                               ...  ...   ...
(501.2, 577.9]  Philippines, Netherlands, Sweden                  0.0  ...   NaN
                Russia                                            0.0  ...   NaN
(577.9, 654.6]  Soviet Union                                      0.0  ...   NaN
(654.6, 731.3]  France                                            1.0  ...  87.0
(731.3, 808.0]  Argentina                                         1.0  ...  77.0

[5565 rows x 8 columns]

##### Exercise 7: Group-by

<ol>
<li>use <code>pd.cut</code> to perform a grouping of one or more of the dataframe columns
<li>use <code>groupby</code> to group by that (those) columns and then perform
<li>three different statistical summaries in three separate instances

In [ ]:
# Cell for excercise 7